Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/mozi__mozi-017-condemnation-of-offensive-war-i__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 今有一人，入人園圃，竊其桃李，衆聞則非之，上爲政者得則罰之。此何也？以虧人自利也。至攘人犬豕雞豚者，其不義又甚入人園圃竊桃李。是何故也？以虧人愈多，其不仁茲甚，罪益厚。
en: Suppose a man enters tlie orchard of another and steals the other’s peaches and plums. Hearing of it the public will condemn it ; laying hold of him the authorities will punish him. Because he injures others to profit himself. As to seizing dogs, pigs, chickens, and young pigs from another, it is even more unrighteous than to steal peaches and plums from his orchard.

source: 至入人欄廏，取人馬牛者，其不仁義又甚攘人犬豕雞豚。
en: Because it causes others to suffer more, and it is more inhumane and criminal.

source: 此何故也？以其虧人愈多。苟虧人愈多，其不仁茲甚，罪益厚。至殺不辜人也，扡其衣裘，取戈劍者，其不義又甚入人欄廄取人馬牛。此何故也？以其虧人愈多。
en: When it comes to entering another’s stable and appropriating the other’s horses and oxen, it is more inhumane than to seize the dogs, pigs, chickens, and young pigs of another. Because others are caused to suffer more ; when others are caused to suffer more, then the act is more inhumane and criminal. Finally, as to murdering the innocent, stripping him of his clothing, dispossessing him of his spear and sword, it is even more unrighteous than to enter another’s stable and appropriate his horses and oxen. Because it causes others to suffer more ; when others are caused to suffer more, then the act is more inhumane and criminal All the gentlemen of the world know that they should condemn these things, calling them umighteous. But when it comes to the great attack of states, they do not know that they should condemn it.

source: 苟虧人愈多，其不仁茲甚矣，罪益厚。
en: On the contrary, they applaud it, calling it righteous.

source: 當此，天下之君子皆知而非之，謂之不義。今至大爲攻國，則弗知非，從而譽之，謂之義。此可謂知義與不義之別乎？殺一人謂之不義，必有一死罪矣，若以此說往，殺十人十重不義，必有十死罪矣；殺百人百重不義，必有百死罪矣。
en: Can this be said to he knowing the difference between righteousness and unrighteousness 1 The murder of one person is called unrighteous and incurs one death penalty. Following this argument, the murder of ten persons will be ten times as unrighteous and there should be ten death penalties ; the murder of a hundred persons will be a hundred times as unrighteous and there should be a hundred death penalties. All the gentlemen of the world know that they should condemn these things, calling them unrighteous. But when it comes to the great unrighteousness of attacking states, they do not know that they should condemn it.

source: 當此，天下之君子皆知而非之，謂之不義。
en: On the contrary, they applaud it, calling it righteous.

source: 今至大爲不義攻國，則弗知非，從而譽之，謂之義，情不知其不義也，故書其言以遺後世。若知其不義也，夫奚說書其不義以遺後世哉？今有人於此，少見黑曰黑，多見黑曰白，則必以此人不知白黑之辯矣；少嘗苦曰苦，多嘗苦曰甘，則必以此人爲不知甘苦之辯矣。今小爲非，則知而非之。
en: And they are really ignorant of its being unrighteous. Hence they have recorded their judgment to bequeath to their posterity. If they did know that it is unrighteous, then why would they record their false judgment to bequeath to posterity ? Now, if there were a man who, upon seeing a little blackness, should say it is black, but, upon seeing much, should say it is white , then we should think he could not tell the difference between black and white. If, upon tasting a little bitterness one should say it is bitter, but, upon tasting much, should say it is sweet ; then we should think he could not tell the difference between bitter and sweet. Kow, when a little wrong is committed people know that they should condemn itj but when such a great wrong as attacking a state is com-initted people do not know that they should condemn it.

source: 大爲非攻國，則不知非，從而譽之，謂之義。此可謂知義與不義之辯乎？是以知天下之君子也，辯義與不義之亂也。
en: On the contrary, it is applauded, called righteous. Can this be said to be knowing the difference between the righteous and the unrighteous ? Hence we know the gentlemen of the world are confused about the difference between righteous-ness and unrighteousness.
